app/views/users/show.html.erb

<br>
<% @user.neopets.each do |n| %>
---
SELECT "neopets".* FROM "neopets" WHERE "neopets"."user_id" = ?  [["user_id", 1]]