app/controllers/neopets_controller.rb

SELECT "neopets".* FROM "neopets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @neopets = Neopet.all
    @user = User.find(params[:id])

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @neopet = Neopet.find(params[:id])

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @neopet = Neopet.find(params[:pet_id])
    @user = User.find(params[:id])

SELECT  "neopets".* FROM "neopets" WHERE "neopets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @neopet = Neopet.find(params[:pet_id])
    @user = User.find(params[:id])