app/controllers/neopets_controller.rb

  def update
    @neopet = Neopet.find(params[:id])
    @neopet = Neopet.update(neopet_params(:name))
---
UPDATE "neopets" SET "user_id" = ?, "updated_at" = ? WHERE "neopets"."id" = ?  [["user_id", 1], ["updated_at", "2019-01-13 22:22:15.540262"], ["id", 2]]